<?php
	if ( ! defined( 'ABSPATH' ) ) {
		exit;
	}
	get_header();?>



    <!-- Заголовок статті -->
    <section class="single-post-heading">
      <!-- Хлібні крихти -->
      <svg class="bg-pic" width="890" height="938" viewBox="0 0 890 938" fill="none" xmlns="http://www.w3.org/2000/svg">
        <g style="mix-blend-mode:luminosity" opacity="0.2">
          <path d="M704.891 303.174C706.373 306.033 707.856 308.892 709.338 311.751C753.51 392.096 763.91 490.664 729.537 583.515C666.657 753.369 477.928 840.133 308.099 777.262C249.39 755.528 200.836 718.841 164.643 673.099C116.764 615.87 89.1298 543.265 87.7001 467.885C73.5936 617.677 160.89 764.349 308.78 819.098C485.11 884.375 681.076 794.284 746.363 617.928C786.829 508.62 767.504 391.732 704.891 303.174Z" fill="#0F0F0F"/>
          <path d="M164.658 451.557C218.437 306.287 366.481 245.814 502.588 296.201C506.245 297.555 509.902 298.908 513.483 300.465C503.245 313.77 493.186 321.598 477.998 333.301C457.399 349.009 450.139 346.783 454.511 355.563C458.575 363.305 491.634 368.844 520.839 356.092C535.088 350.047 550.172 337.38 562.194 326.122C596.143 350.471 626.037 381.406 642.164 418.333C648.847 433.975 657.691 475.598 663.071 482.904C668.527 490.006 684.274 496.76 685.566 478.294C686.859 459.829 683.315 461.289 687.978 448.693C692.567 436.299 699.54 424.326 704.323 410.157C715.267 377.476 700.244 325.711 676.812 287.927C645.697 237.828 603.456 207.174 556.311 186.025L556.762 184.806C551.225 182.294 545.612 179.985 539.924 177.879C537.484 158.263 528.731 126.377 500.357 101.318C455.978 62.7115 441.759 69.9227 439.676 74.9269C434.907 86.5606 460.423 119.34 449.653 157.167C311.955 144.771 177.433 225.498 126.963 361.828C70.251 515.022 160.939 648.164 160.939 648.164C160.939 648.164 124.794 559.24 164.658 451.557ZM514.265 299.6L514.642 298.584C514.845 298.659 514.845 298.659 515.048 298.734C514.694 299.065 514.416 299.193 514.265 299.6Z" fill="#0F0F0F"/>
          <path d="M553.692 403.369C525.033 389.063 494.531 382.854 464.542 383.996C472.465 386.929 480.313 390.065 487.859 394.014C591.088 445.859 632.887 571.299 581.038 674.544C567.032 702.395 547.758 725.755 524.813 744.059C571.406 729.888 612.293 697.435 635.702 650.425C681.316 559.656 644.649 449.054 553.692 403.369Z" fill="#464646"/>
          <path d="M466.193 433.815C518.571 493.865 533.996 581.356 498.568 658.338C474.573 710.675 431.805 748.208 381.91 766.931C451.241 769.958 518.573 731.585 548.999 664.995C589.001 578.155 551.862 475.694 466.193 433.815Z" fill="#464646"/>
          <path d="M390.073 480.947C388.726 480.217 387.304 479.69 385.957 478.961C424.574 528.141 433.887 597.198 403.889 657.016C379.097 706.517 332.882 738.384 282.159 746.867C348.497 767.96 422.052 738.359 454.187 674.019C489.894 603.146 461.137 516.726 390.073 480.947Z" fill="#464646"/>
          <path d="M557.043 343.158C552.115 347.109 544.757 352.009 534.383 356.947C573.929 373.666 606.922 399.973 631.498 432.173C614.137 397.33 588.96 366.756 557.043 343.158Z" fill="#464646"/>
          <path d="M213.797 495.391C251.78 392.787 352.357 331.376 456.237 338.413C456.793 338.157 457.147 337.826 457.501 337.495C466.506 332.512 483.41 318.671 494.123 309.7C366.984 263.788 226.261 328.819 179.176 456.007C141.945 556.579 174.548 665.677 252.123 730.665C200.768 666.604 183.259 577.88 213.797 495.391Z" fill="#464646"/>
        </g>
      </svg>


    </section>

    <!-- Стаття -->
    <section class="block-post-content indent-bottom-small">
      <div class="container-fluid">
        <div class="row">
          <div class="content col-lg-8">
            <ul class="crumbs-list">
              <li class="crumb">
                <a href="<?php echo home_url('/');?>">
				          <?php echo get_the_title( get_option('page_on_front') );;?>
                </a>
                <svg class="separator" xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
                  <path d="M5 2L10.1958 6.76285C10.6282 7.15918 10.6282 7.84082 10.1958 8.23715L5 13" stroke="#575757" stroke-linecap="round"/>
                </svg>
              </li>
		          <?php
			          $blogLinkUa = carbon_get_theme_option('blog_ua_page');
			          $blogLinkRu = carbon_get_theme_option('blog_ru_page');

			          $currentLang = dolphincargo_lang_prefix();

			          if( $currentLang == '_uk' && !empty($blogLinkUa )):?>

                  <li class="crumb">
                    <a href="<?php echo get_permalink($blogLinkUa[0]['id']);?>">
						          <?php echo get_the_title($blogLinkUa[0]['id']);?>
                    </a>
                    <svg class="separator" xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
                      <path d="M5 2L10.1958 6.76285C10.6282 7.15918 10.6282 7.84082 10.1958 8.23715L5 13" stroke="#575757" stroke-linecap="round"/>
                    </svg>
                  </li>
			          <?php endif;?>
		          <?php if( $currentLang == '_ru' && !empty($blogLinkRu ) ):?>
                <li class="crumb">
                  <a href="<?php echo get_permalink($blogLinkRu[0]['id']);?>">
					          <?php echo get_the_title($blogLinkRu[0]['id']);?>
                  </a>
                  <svg class="separator" xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
                    <path d="M5 2L10.1958 6.76285C10.6282 7.15918 10.6282 7.84082 10.1958 8.23715L5 13" stroke="#575757" stroke-linecap="round"/>
                  </svg>
                </li>
		          <?php endif;?>

              <li class="crumb current-crumb">
			          <?php the_title();?>
              </li>
            </ul>
            <div class="post-hero">
              <h1 class="block-title big-title"><?php the_title();?></h1>
              <div class="post-info-wrapper">
                <p class="data-publish"><?php echo get_the_date('M d, Y');?></p>
		            <?php

			            $post = get_post(get_the_ID());

			            $text = wp_strip_all_tags($post->post_content);
			            $length = mb_strlen($text, 'UTF-8');

			            $readingtime = ceil($length / 200);

			            $totalreadingtime = $readingtime;

			            if (!empty($totalreadingtime)):?>
                    <p class="reading-time">
	                    <svg version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 122.88 122.79" style="enable-background:new 0 0 122.88 122.79" xml:space="preserve"><g><path d="M84.95,4.57c22.91,9.49,37.93,31.86,37.93,56.78c0,16.97-6.88,32.33-17.99,43.45c-11.12,11.12-26.48,18-43.45,18 c-16.96,0-32.32-6.88-43.44-18C6.88,93.67,0,78.31,0,61.35C0,36.62,15.37,13.55,38.24,4.17C52.4-1.63,70.85-1.27,84.95,4.57 L84.95,4.57z M51.99,59.71c0.77-0.84,1.7-1.56,2.71-2.11V30.87c0-2.73,2.21-4.93,4.93-4.93c2.73,0,4.94,2.21,4.94,4.93V57.6 c1.8,0.97,3.28,2.45,4.25,4.25H89.1c2.73,0,4.93,2.21,4.93,4.93s-2.21,4.93-4.93,4.93H68.83c-1.76,3.28-5.21,5.51-9.19,5.51 c-3.13,0-5.93-1.38-7.84-3.56C48.25,69.61,48.42,63.57,51.99,59.71L51.99,59.71z M97.91,25.84C72.46,0.39,29.53,7.58,14.64,39.64 c-3.06,6.6-4.77,13.95-4.77,21.7c0,14.25,5.77,27.14,15.1,36.47s22.23,15.11,36.47,15.11c14.24,0,27.14-5.78,36.47-15.11 c9.33-9.33,15.11-22.23,15.11-36.47c0-8.08-1.86-15.73-5.17-22.54C105.33,33.65,101.97,29.9,97.91,25.84L97.91,25.84z"/></g>
                      </svg>
					            <?php echo $totalreadingtime;?> <?php echo esc_html( pll__( 'хвилин' ) ); ?>
                    </p>
			            <?php endif;?>
              </div>
              <div class="post-image">
		            <?php echo get_the_post_thumbnail(get_the_ID());?>
              </div>
            </div>
	          <?php the_content();?>
          </div>
          <div class="col-lg-4 post-navigation" id="single-post-navigation">
            <div class="inner">
              <h3 class="navigation-title"><?php echo esc_html( pll__( 'Навігація по статті' ) ); ?></h3>
              <ul class="post-nav-list"></ul>
            </div>

          </div>
        </div>
      </div>
    </section>

<?php get_footer();